cf_billing/DataProcessors/энргФилиалыСтроенийМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргФилиалыСтроенийМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргФилиалыСтроений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФилиалыСтроений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргФилиалыАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргФилиалыАбонентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргЗоныОтвественности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргЗоныОтвественности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодРайона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗаписьДляОтправкиПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторAPIОплатыЛК</Name>
					<Comment>Содержит внешний ключ API оплаты для личного кабинета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Филиалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргФилиалыСтроенийМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает текущее значение филиала.
//
// Параметры:
//  Организация	 - 	СправочникСсылка.Организации.
//  Район		 - 	СправочникСсылка.энргЗоныОтвественности.
//  Строение	 - 	СправочникСсылка.энргСтроения.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргФилиалы.
//
Функция ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= РегистрыСведений.энргФилиалыСтроений.ПолучитьТекущееЗначениеФилиала(Организация, Район, Строение);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.ПолучитьТекущееЗначениеФилиала";
		ПараметрыМетода 			= Новый Структура("Организация, Район, Строение", Организация, Район, Строение);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;  		
	
	
КонецФункции

// Возвращает Филиалы района.
//
// Параметры:
//  Район	-	СправочникСсылка.энргЗоныОтвественности.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргФилиалы.
//
Функция ФилиалыРайона(Район) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].ФилиалыРайона(Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Справочники.энргЗоныОтвественности.ФилиалыРайона(Район);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.ФилиалыРайона";
		ПараметрыМетода 			= Новый Структура("Район", Район);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает список филиалов по организации району стронию абоненту.
//
// Параметры:
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  Строение	-	СправочникСсылка.энргСтроения.
//  Абонент		-	СправочникСсылка.энргАбоненты.
//  Период		-	Дата.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргФилиалы.
//
Функция СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту(Организация, Район, Строение, Абонент, Период = '0001-01-01') Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту(Организация, Район, Строение, Абонент, Период);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат 						= Новый СписокЗначений;
	
	Если НЕ Абонент = Неопределено И ЗначениеЗаполнено(Абонент) Тогда
		ФилиалАбонента				= ФилиалАбонента(Абонент,Период);
		Результат.Добавить(ФилиалАбонента);
	ИначеЕсли Не Организация = Неопределено и ЗначениеЗаполнено(Организация)
		И Не Район = Неопределено и ЗначениеЗаполнено(Район)
		И Не Строение = Неопределено и ЗначениеЗаполнено(Строение) Тогда
		ФилиалСтроения 				= ПолучитьТекущееЗначениеФилиала(Организация,Район,Строение);
		Результат.Добавить(ФилиалСтроения);
	Иначе
		ПараметрыЗапроса 			= Новый Структура;
		Схема 						= Неопределено;
		ПараметрыСхемы 				= Новый Структура;
		Если НЕ Период = Неопределено Тогда
			ПараметрыСхемы.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
			ПараметрыЗапроса.Вставить("Период", Период);
		КонецЕсли;
		СоотвествиеПолей 			= Новый Структура;
		
		Если НЕ Организация = Неопределено Тогда
			СоотвествиеПолей.Вставить("Организация", "Организация");
			ПараметрыЗапроса.Вставить("Организация", Организация);
		КонецЕсли;
		
		Если НЕ Район = Неопределено Тогда
			СоотвествиеПолей.Вставить("Район", "Район");
			ПараметрыЗапроса.Вставить("Район", Район);
		КонецЕсли;
		
		Если НЕ Строение = Неопределено Тогда
			СоотвествиеПолей.Вставить("Строение", "Строение");
			ПараметрыЗапроса.Вставить("Строение", Строение);
		КонецЕсли;
		
		ПараметрыВТ  				= Новый Массив;
		ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(СоотвествиеПолей));
		ПараметрыСхемы.Вставить("ПараметрыВТ", ПараметрыВТ);
		
		РегистрыСведений.энргФилиалыСтроений.ЗаполнитьСхемуФилиалыСтроение(Схема,ПараметрыСхемы,"");
		
		РезультатЗапроса  			= энргСхемаЗапросаСервер.ВыполнитьЗапрос(Схема,ПараметрыЗапроса);
		Выборка 					= РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Результат.Добавить(Выборка.Филиал);
		КонецЦикла;		
	КонецЕсли;
	
	Если НЕ Результат.Количество() = 0 И Не Район = Неопределено и ЗначениеЗаполнено(Район) Тогда
		Результат 	 				= Обработки.энргЗоныОтвественностиМенеджер.ФилиалыРайона(Район);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.СписокФилиаловПоОрганизацииРайонуСтрониюАбоненту";
		ПараметрыМетода 			= Новый Структура("Организация, Район, Строение, Абонент, Период", Организация, Район, Строение, Абонент, Период);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает Филиал абонента.
//
// Параметры:
//  Абонент	-	СправочникСсылка.энргАбоненты.
//  Период	-	Дата.
// 
// Возвращаемое значение:
//   СправочникСсылка.энргФилиалы.
//
Функция ФилиалАбонента(Абонент, Период = '0001-01-01') Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжФилиалыСтроенийМенеджер") = Неопределено Тогда
				Возврат Обработки["слжФилиалыСтроенийМенеджер"].ФилиалАбонента(Абонент,Период);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат  = РегистрыСведений.энргФилиалыАбонентов.ПолучитьПоследнее(Период,Новый Структура("Абонент",Абонент)).Филиал;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ФилиалыСтроенийМенеджер.ФилиалАбонента";
		ПараметрыМетода 			= Новый Структура("Абонент,Период", Абонент,Период);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
